
*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::iterator<struct std::random_access_iterator_tag, _Bool, long, _Bool *, _Bool &> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::_Bit_iterator_base
         0 |   struct std::iterator<struct std::random_access_iterator_tag, _Bool, long, _Bool *, _Bool &> (base) (empty)
         0 |   std::_Bit_type * _M_p
         8 |   unsigned int _M_offset
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::_Bit_iterator
         0 |   struct std::_Bit_iterator_base (base)
         0 |     struct std::iterator<struct std::random_access_iterator_tag, _Bool, long, _Bool *, _Bool &> (base) (empty)
         0 |     std::_Bit_type * _M_p
         8 |     unsigned int _M_offset
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<int> (empty)
         0 |   class __gnu_cxx::new_allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::_Vector_base<int, class std::allocator<int> >::_Vector_impl
         0 |   class std::allocator<int> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<int> (base) (empty)
         0 |   std::_Vector_base<int, class std::allocator<int> >::pointer _M_start
         8 |   std::_Vector_base<int, class std::allocator<int> >::pointer _M_finish
        16 |   std::_Vector_base<int, class std::allocator<int> >::pointer _M_end_of_storage
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::_Vector_base<int, class std::allocator<int> >
         0 |   struct std::_Vector_base<int, class std::allocator<int> >::_Vector_impl _M_impl
         0 |     class std::allocator<int> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<int> (base) (empty)
         0 |     std::_Vector_base<int, class std::allocator<int> >::pointer _M_start
         8 |     std::_Vector_base<int, class std::allocator<int> >::pointer _M_finish
        16 |     std::_Vector_base<int, class std::allocator<int> >::pointer _M_end_of_storage
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::vector<int, class std::allocator<int> >
         0 |   struct std::_Vector_base<int, class std::allocator<int> > (base)
         0 |     struct std::_Vector_base<int, class std::allocator<int> >::_Vector_impl _M_impl
         0 |       class std::allocator<int> (base) (empty)
         0 |         class __gnu_cxx::new_allocator<int> (base) (empty)
         0 |       std::_Vector_base<int, class std::allocator<int> >::pointer _M_start
         8 |       std::_Vector_base<int, class std::allocator<int> >::pointer _M_finish
        16 |       std::_Vector_base<int, class std::allocator<int> >::pointer _M_end_of_storage
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x3863ab8[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/6.5.0/../../../../include/c++/6.5.0/ext/new_allocator.h:57:3[0m, [0;33mline:135:5[0m> [0;33mline:58:11[0m class[0;1;36m new_allocator[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0mTemplateArgument type [0;32m'int'[0m
